Tekla Open API Reference for Tekla Structures 2025
LeaderLineAndParentObjectAlongPartPlacingType Class
 The LeaderLineAndParentObjectAlongPartPlacingType class defines a placing type that places the object with a leader line and rotated to be at the same angle as the connected part.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.PreferredPlacingTypeBase
 Tekla.Structures.Drawing.LeaderLineAndParentObjectAlongPartPlacingType
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class LeaderLineAndParentObjectAlongPartPlacingType : PreferredPlacingTypeBase
<SerializableAttribute>
Public Class LeaderLineAndParentObjectAlongPartPlacingType
	Inherits PreferredPlacingTypeBase
The LeaderLineAndParentObjectAlongPartPlacingType type exposes the following members.
Constructors
Name | Description
LeaderLineAndParentObjectAlongPartPlacingType
 Creates a new leader line and parent object along part placing type instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace